In [33]:
import pandas as pd
source_df = pd.read_csv('resource/data_Customer_Segmentation.csv',encoding='ISO-8859-1')
source_df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

.groupby()

In [18]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Type': ['big','big','small','small'],
                   'Max Speed': [380., 370., 24., 26],
                   'price': [4,3,6,10],
                   })
df

   Animal   Type  Max Speed  price
0  Falcon    big      380.0      4
1  Falcon    big      370.0      3
2  Parrot  small       24.0      6
3  Parrot  small       26.0     10

In [21]:
## chỉ thực hiện với cột số, cột có ít nhất 1 ô không phải number sẽ được bỏ qua
# df.groupby('Animal').mean(numeric_only=True)
df.groupby(['Animal']).mean(numeric_only=True)

        Max Speed  price
Animal
Falcon      375.0    3.5
Parrot       25.0    8.0

In [54]:
source_df.groupby(by=["CustomerID"]).sum()

/tmp/ipykernel_13920/1476394699.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  source_df.groupby(by=["CustomerID"]).sum()

            Quantity  UnitPrice
CustomerID
12346.0            0       2.08
12347.0         2458     481.21
12348.0         2341     178.71
12349.0          631     605.10
12350.0          197      65.30
...              ...        ...
18280.0           45      47.65
18281.0           54      39.36
18282.0           98      62.68
18283.0         1397    1220.93
18287.0         1586     104.55

[4372 rows x 2 columns]

In [52]:
# group nhiều cột và chỉ lấy ra vài cột
source_df_sub1 = source_df.groupby(by=["CustomerID","InvoiceNo"])[["StockCode","Description"]].count()
source_df_sub1.head(5)

                      StockCode  Description
CustomerID InvoiceNo
12346.0    541431             1            1
           C541433            1            1
12347.0    537626            31           31
           542237            29           29
           549222            24           24

In [ ]:
# using với .apply()
source_df_sub2 = source_df[["InvoiceNo","CustomerID"]]
df_group_cusid  =  source_df_sub2.groupby("CustomerID",group_keys=False).apply(lambda x : x).drop_duplicates()
df_group_cusid.index.to_list()

## Bài tập K30

In [3]:
import pandas as pd
df_initial = pd.read_csv('resource/data_Customer_Segmentation.csv',encoding='ISO-8859-1')
df_initial

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [ ]:
df_initial.dropna(axis = 0, subset = ['CustomerID'], inplace = True)
print('Dataframe dimensions:', df_initial.shape)
#____________________________________________________________
# gives some infos on columns types and numer of null values
tab_info=pd.DataFrame(df_initial.dtypes).T.rename(index={0:'column type'})
tab_info=tab_info.append(pd.DataFrame(df_initial.isnull().sum()).T.rename(index={0:'null values (nb)'}))
tab_info=tab_info.append(pd.DataFrame(df_initial.isnull().sum()/df_initial.shape[0]*100).T.
                         rename(index={0:'null values (%)'}))
display(tab_info)

In [55]:
# 1. 1 user đã chi bao nhiêu tiền trong toàn bộ thời gian
df_initial['Total'] = df_initial['Quantity']*df_initial['UnitPrice']
# df_initial.loc[df_initial['CustomerID'] == 12346.0] 
df_initial.groupby(['CustomerID'])[['Total']].sum()

              Total
CustomerID
12346.0        0.00
12347.0     4310.00
12348.0     1797.24
12349.0     1757.55
12350.0      334.40
...             ...
18280.0      180.60
18281.0       80.82
18282.0      176.60
18283.0     2094.88
18287.0     1837.28

[4372 rows x 1 columns]

In [56]:
# 12346 = 0 là do nó mua xong nó hủy
df_initial.loc[df_initial['CustomerID'] == 12346.0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total,Year-Month,Year
61619,541431,23166,MEDIUM CERAMIC TOP STORAGE JAR,74215,1/18/2011 10:01,1.04,12346.0,United Kingdom,77183.6,2011-01,2011
61624,C541433,23166,MEDIUM CERAMIC TOP STORAGE JAR,-74215,1/18/2011 10:17,1.04,12346.0,United Kingdom,-77183.6,2011-01,2011

In [18]:
# 2. 1 user đã chi bao nhiêu tiền trong mỗi tháng
df_initial['Year-Month'] = pd.to_datetime(df_initial['InvoiceDate']).dt.strftime('%Y-%m')
df_initial.groupby(['CustomerID','Year-Month'])[['Total']].sum()

                         Total
CustomerID Year-Month
12346.0    2011-01        0.00
12347.0    2010-12      711.79
           2011-01      475.39
           2011-04      636.25
           2011-06      382.52
...                        ...
18283.0    2011-10      114.65
           2011-11      651.56
           2011-12      208.00
18287.0    2011-05      765.28
           2011-10     1072.00

[13675 rows x 1 columns]

In [24]:
# 3. Thông kê giúp mình theo mỗi quốc gia, mức chi hằng tháng là bao nhiêu
df_initial.groupby(['Country','Year-Month'])[['Total']].sum()

                           Total
Country     Year-Month
Australia   2010-12      1005.10
            2011-01      9017.71
            2011-02     14627.47
            2011-03     17055.29
            2011-04       333.40
...                          ...
Unspecified 2011-04       299.10
            2011-05       852.68
            2011-06       185.78
            2011-07       798.48
            2011-08       531.03

[298 rows x 1 columns]

In [52]:
# 4.1 top 10 customer chi nhiều nhất theo năm

# convert $Y
df_initial['Year'] = pd.to_datetime(df_initial['InvoiceDate']).dt.strftime('%Y')

# group year, id
df_group_year = df_initial.groupby(['Year','CustomerID'])[['Total']].sum()

# sort year, total
df_group_year = df_group_year.sort_values(['Year','Total'], ascending=[True,False])

# get index
list_year = df_initial['Year'].drop_duplicates().to_list()

# get top
for year in list_year:
    top_10 = df_group_year.loc[year].head(10)
    print(f'''
          {year}
          {top_10}''')

          2010
                         Total
CustomerID
18102.0     27834.61
15061.0     19950.66
16029.0     13112.52
14646.0      8591.88
16210.0      7000.64
13777.0      6919.78
14911.0      6757.13
17511.0      6634.76
13089.0      5833.21
17850.0      5391.21

          2011
                          Total
CustomerID
14646.0     270897.14
18102.0     228603.88
17450.0     185453.33
14911.0     125815.49
12415.0     123725.45
14156.0     113069.44
17511.0      81490.62
16684.0      62778.68
13694.0      59768.06
14096.0      57120.91

In [51]:
# 4.2  top 10 customer chi nhiều nhất theo từng tháng

# convert y-m
df_initial['Year-Month'] = pd.to_datetime(df_initial['InvoiceDate']).dt.strftime('%Y-%m')

# group Year-Month, ID
df_group_year_month = df_initial.groupby(['Year-Month','CustomerID'])[['Total']].sum()

# sort Year-Month, Total
df_group_year_month = df_group_year_month.sort_values(['Year-Month','Total'], ascending=[True,False])

# get index
list_year_month = df_initial['Year-Month'].drop_duplicates().to_list()

# get top
for year_month in list_year_month:
    top_10 = df_group_year_month.loc[year_month].head(10)
    print(f'''
          {year_month}
          {top_10}''')

          2010-12
                         Total
CustomerID
18102.0     27834.61
15061.0     19950.66
16029.0     13112.52
14646.0      8591.88
16210.0      7000.64
13777.0      6919.78
14911.0      6757.13
17511.0      6634.76
13089.0      5833.21
17850.0      5391.21

          2011-01
                         Total
CustomerID
14646.0     26476.68
15749.0     22998.40
17450.0     18620.20
14156.0     16774.72
14088.0      7544.91
12415.0      7092.98
15769.0      5544.48
15311.0      5475.65
13089.0      5124.58
14911.0      4896.80

          2011-02
                         Total
CustomerID
14646.0     22752.46
12415.0     14022.92
18102.0     10535.48
17511.0      7709.59
16684.0      6545.94
14156.0      6106.53
12753.0      5735.24
15311.0      4645.15
15769.0      4552.80
16029.0      4200.36

          2011-03
                         Total
CustomerID
14646.0     21462.40
12415.0     16558.14
17450.0     13500.50
15769.0     12992.40
14156.0      9739.67
13694.0      8089.22
17511.0      7189.00
14911.0      7053.05
18102.0      6909.32
15311.0      6356.55

          2011-04
                        Total
CustomerID
14298.0     9656.85
16333.0     7325.84
17857.0     6367.20
14911.0     4572.32
15311.0     4156.45
16684.0     4018.36
17450.0     3559.30
12753.0     3513.91
13089.0     3268.36
17389.0     3019.00

          2011-05
                         Total
CustomerID
14646.0     28408.14
18102.0     18165.74
17450.0     18025.68
12415.0     12691.16
12590.0      9864.26
14911.0      9349.27
17511.0      7176.73
16684.0      6426.52
15311.0      5796.61
13694.0      5466.88

          2011-06
                         Total
CustomerID
18102.0     41959.44
14646.0     25288.99
12415.0     23426.81
17949.0     20427.98
14911.0     10065.00
14156.0      9757.79
14088.0      7843.09
15311.0      7365.36
12409.0      6207.08
13694.0      6041.75

          2011-07
                         Total
CustomerID
14156.0     26464.99
18102.0     19889.16
14911.0     13445.33
17949.0     11590.58
14088.0      9038.69
16684.0      8807.56
17450.0      8485.14
17511.0      7572.52
17404.0      6458.68
14680.0      6256.30

          2011-08
                         Total
CustomerID
14646.0     39655.81
12415.0     21880.44
12931.0     21149.05
17450.0     15952.38
16029.0     10461.70
13694.0      9493.19
15769.0      8489.00
17511.0      8390.13
14911.0      7030.29
12688.0      4873.81

          2011-09
                         Total
CustomerID
17450.0     70246.50
18102.0     49622.18
14646.0     26750.70
14911.0     21012.17
14156.0     19578.52
14298.0      8645.62
17511.0      8190.21
14096.0      8016.98
17949.0      7371.60
13089.0      7329.92

          2011-10
                         Total
CustomerID
18102.0     52681.27
14646.0     39995.95
16684.0     19180.90
14911.0     17433.29
14096.0     16813.70
12415.0     16471.77
15838.0     10992.96
16029.0     10860.96
12678.0      8947.96
14088.0      8132.31

          2011-11
                         Total
CustomerID
17450.0     27837.45
14646.0     25375.41
14096.0     24434.45
14911.0     22536.21
14088.0     16851.61
18102.0     15331.08
17389.0     12361.36
17511.0     10991.36
13081.0      9414.36
12748.0      9295.57

          2011-12
                         Total
CustomerID
16000.0     12393.70
14646.0     11728.02
18102.0     11485.54
14096.0      7835.54
17511.0      7379.32
14911.0      6976.37
17389.0      5876.78
16684.0      5401.98
13089.0      4681.62
15061.0      3895.86

In [69]:
# có bao nhieeu orrder huỷ
df_initial['Country'].value_counts().index.to_list()

['United Kingdom',
 'Germany',
 'France',
 'EIRE',
 'Spain',
 'Netherlands',
 'Belgium',
 'Switzerland',
 'Portugal',
 'Australia',
 'Norway',
 'Italy',
 'Channel Islands',
 'Finland',
 'Cyprus',
 'Sweden',
 'Austria',
 'Denmark',
 'Japan',
 'Poland',
 'USA',
 'Israel',
 'Unspecified',
 'Singapore',
 'Iceland',
 'Canada',
 'Greece',
 'Malta',
 'United Arab Emirates',
 'European Community',
 'RSA',
 'Lebanon',
 'Lithuania',
 'Brazil',
 'Czech Republic',
 'Bahrain',
 'Saudi Arabia']

In [68]:
df_initial.loc[df_initial['Country'] == 'United Kingdom']

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total,Year-Month,Year
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30,2010-12,2010
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34,2010-12,2010
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00,2010-12,2010
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34,2010-12,2010
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34,2010-12,2010
...,...,...,...,...,...,...,...,...,...,...,...
541889,581585,22466,FAIRY TALE COTTAGE NIGHT LIGHT,12,12/9/2011 12:31,1.95,15804.0,United Kingdom,23.40,2011-12,2011
541890,581586,22061,LARGE CAKE STAND HANGING STRAWBERY,8,12/9/2011 12:49,2.95,13113.0,United Kingdom,23.60,2011-12,2011
541891,581586,23275,SET OF 3 HANGING OWLS OLLIE BEAK,24,12/9/2011 12:49,1.25,13113.0,United Kingdom,30.00,2011-12,2011
541892,581586,21217,RED RETROSPOT ROUND CAKE TINS,24,12/9/2011 12:49,8.95,13113.0,United Kingdom,214.80,2011-12,2011
541893,581586,20685,DOORMAT RED RETROSPOT,10,12/9/2011 12:49,7.08,13113.0,United Kingdom,70.80,2011-12,2011